Revit 2026 API

# ConnectorProfileType Enumeration

---

An enumerated type listing all connector profile types

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ConnectorProfileType
```
```vb
Public Enumeration ConnectorProfileType
```
```cpp
public enum class ConnectorProfileType
```
```fsharp
type ConnectorProfileType
```

| Member name | Value | Description |
| --- | --- | --- |
| Invalid | -1 | Invalid connector profile |
| Oval | 2 | Oval connector profile |
| Rectangular | 1 | Rectangular connector profile |
| Round | 0 | Round connector profile |

#### Reference

Autodesk.Revit.DB Namespace